org/spiking_software.org
#+SETUPFILE:./hugo_setup.org
#+TITLE: SNN Software

Software for [[file:spiking_neural_networks.org][§spiking_neural_networks]].

* Python
- [[https://github.com/BindsNET/bindsnet][GitHub - BindsNET/bindsnet: Simulation of spiking neural networks (SNNs) usin...]]
- [[https://github.com/norse/norse/][GitHub - norse/norse: A library to do deep learning with spiking neural netwo...]]
- [[https://brian2.readthedocs.io/en/stable/][Brian 2 documentation — Brian 2 2.3 documentation]]

* Paper Implementations
- [[https://github.com/surrogate-gradient-learning][Surrogate Gradient Learning · GitHub]]
- [[https://github.com/bamsumit/slayerPytorch][GitHub - bamsumit/slayerPytorch: PyTorch implementation of SLAYER for trainin...]]
- [[https://github.com/uber-research/backpropamine][GitHub - uber-research/backpropamine: Train self-modifying neural networks wi...]]
- [[https://github.com/fzenke/pub2018superspike][GitHub - fzenke/pub2018superspike: Code from our paper: SuperSpike: Supervise...]]
- [[https://github.com/nmi-lab/dcll][GitHub - nmi-lab/dcll]]
