content/zettels/spiking_software.md
+++
title = "SNN Software"
author = ["Jethro Kuan"]
lastmod = 2020-02-06T00:09:27+08:00
draft = false
+++

Software for [§spiking\_neural\_networks]({{< relref "spiking_neural_networks" >}}).


## Python {#python}

-   [GitHub - BindsNET/bindsnet: Simulation of spiking neural networks (SNNs) usin...](https://github.com/BindsNET/bindsnet)
-   [GitHub - norse/norse: A library to do deep learning with spiking neural netwo...](https://github.com/norse/norse/)
-   [Brian 2 documentation — Brian 2 2.3 documentation](https://brian2.readthedocs.io/en/stable/)


## Paper Implementations {#paper-implementations}

-   [Surrogate Gradient Learning · GitHub](https://github.com/surrogate-gradient-learning)
-   [GitHub - bamsumit/slayerPytorch: PyTorch implementation of SLAYER for trainin...](https://github.com/bamsumit/slayerPytorch)
-   [GitHub - uber-research/backpropamine: Train self-modifying neural networks wi...](https://github.com/uber-research/backpropamine)
-   [GitHub - fzenke/pub2018superspike: Code from our paper: SuperSpike: Supervise...](https://github.com/fzenke/pub2018superspike)
-   [GitHub - nmi-lab/dcll](https://github.com/nmi-lab/dcll)
